# Что улучшить:
# Деление на 0: Если пользователь введет 0 во второе число,
# программа выдаст ошибку. Чтобы это предотвратить, добавим проверку.

'''number1 = int(input('Введите первое число:'))
number2 = int(input('Введите второе число:'))
print(f'Разность {number1 - number2}')
print(f'Произведение {number1 * number2}')
if number2 != 0:
    print(f'Частное {number1 / number2}')
else:
    print('На 0 делить нельзя!')'''

# Отлично, Нурбек! Ваш код теперь защищен от деления на ноль,
# и вы уверенно справляетесь с основами. Давайте двигаться дальше и познакомимся с условиями (if).

'''number = int(input('Введите целое число: '))
if number > 0:
    print('Число положительное')
elif number < 0:
    print('Число отрицательное')
else:
    print('Это ноль')'''

# Почему лучше использовать короткий текст:
# Читаемость: Когда результат лаконичен, его проще понять пользователю.
# Универсальность: Такие строки можно легко адаптировать для других языков или приложений.
# Если вам нравится ваш стиль — это тоже нормально, главное, чтобы программа была понятной.

