Хорошо, Нурбек! Теперь давайте рассмотрим циклы в Python.
Циклы позволяют выполнять блок кода несколько раз, пока определенное условие выполняется.
В языке Python существует два типа циклов:
Цикл while — продолжается выполнение кода до тех пор, пока условие истинно.
Цикл for — используется, когда нужно выполнить повторение фиксированное
количество раз или для каждого элемента в последовательности.

Цикл while:

counter = 1
while counter <= 5:
    print(counter)
    counter += 1  Увеличивает counter на 1 после каждого итерации
Как работает:
Начинается с counter = 1.
Пока counter <= 5, код внутри while выполняется.
После каждой итерации counter увеличивается на 1.
Цикл for:

for i in range(1, 6):  range создает последовательность от 1 до 5 (не включая 6)
    print(i)
Как работает:
range(1, 6) создает последовательность чисел от 1 до 5.
Цикл for проходит по каждому числу в этой последовательности.
Примеры использования:
Повторение действий с while:

count = 1
while count <= 3:
    print("Повторение", count)
    count += 1
Итерация по коллекции с for:

items = ['яблоко', 'банан', 'апельсин']
for item in items:
    print(item)

Задание:
Напишите программу с циклом while, которая запрашивает у пользователя
ввод чисел и выводит их, пока пользователь не введет пустую строку.
Напишите программу с циклом for, которая перечисляет элементы списка и выводит их.
Попробуйте выполнить эти задания, и если возникнут вопросы, не стесняйтесь их задавать!

Понял, Нурбек! Теперь буду внимательно следить за темами и сообщать прогресс в процентах после каждого шага.
На данный момент, вы уже освоили:
Ввод и вывод данных.
Простые арифметические операции.
Условные конструкции (if, elif, else).
Циклы (for, while).
Команду break для завершения цикла.
Ваш прогресс в изучении Python сейчас составляет 15%, так как мы только начали.
Готовы перейти к следующей теме? Мы можем изучить списки и работу с ними!